# Projeto de notas de alunos com o método apply()

In [1]:
# Importando bibliotecas

import pandas as pd

In [2]:
# Criando dados dos alunos

dados_alunos = {'Nomes':['Alice', 'Alan', 'Carol', 'Anelise', 'Evelyn', 'Davi'],
                'Matematica':[90, 85, 70, 60, 100, 98],
                'Ciencias':[20, 50, 70, 90, 100, 98],
                'Portugues':[90, 50, 70, 77, 30, 100]}

In [3]:
dados_alunos

{'Nomes': ['Alice', 'Alan', 'Carol', 'Anelise', 'Evelyn', 'Davi'],
 'Matematica': [90, 85, 70, 60, 100, 98],
 'Ciencias': [20, 50, 70, 90, 100, 98],
 'Portugues': [90, 50, 70, 77, 30, 100]}

In [4]:
df_notas = pd.DataFrame(dados_alunos)

In [5]:
df_notas

     Nomes  Matematica  Ciencias  Portugues
0    Alice          90        20         90
1     Alan          85        50         50
2    Carol          70        70         70
3  Anelise          60        90         77
4   Evelyn         100       100         30
5     Davi          98        98        100

In [6]:
# Definir função para gerar a media das notas

def calculo_media(linha):
    return linha[['Matematica','Ciencias', 'Portugues']].mean()

In [7]:
# Criando uma coluna
# O parâmetro axis=1 é essencial aqui porque indica que a função deve ser aplicada ao longo das colunas, ou seja,
# para cada linha do DataFrame. Se você usasse axis=0, a função seria aplicada a cada coluna, o que não é o caso comum
# quando você está calculando algo com base nos valores em várias colunas para cada linha.

df_notas['Media'] = df_notas.apply(calculo_media, axis = 1)

In [8]:
df_notas

     Nomes  Matematica  Ciencias  Portugues      Media
0    Alice          90        20         90  66.666667
1     Alan          85        50         50  61.666667
2    Carol          70        70         70  70.000000
3  Anelise          60        90         77  75.666667
4   Evelyn         100       100         30  76.666667
5     Davi          98        98        100  98.666667